//ARIuuggC  JOB MSGLEVEL=(1,1),CLASS=A,MSGCLASS=H,
// NOTIFY=&SYSUID,REGION=5M
//*
//* CE JOB PERMET DE FAIRE .....
//*
//COP0gg EXEC PGM=IEBCOPY
//*
//IN DD DSN=ARIGG.ARIUUGG.JCL,DISP=SHR
//OUT DD DSN=ARIgg.ARIuugg.JCL2,
//       DISP=(NEW,CATLG,DELETE),
//       VOL=SER=WRK001,UNIT=3390,SPACE=(TRK,(2,1,5)),
//       DCB=(DSORG=PO,LRECL=80,RECFM=FB)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 COPY INDD=IN,OUTDD=OUT
//*
