//ARIGGUUC JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,REGION=5M
//*
//* COPIE FICHIER MOUVEMENTS DANS ENVIRONNEMENT FORMATION
//*
//IEBGEN  EXEC PGM=IEBGENER
//SYSUT1   DD DSN=ARISYS.ADREF.XV99R00.MVTS,DISP=SHR
//SYSUT2   DD DSN=ARIGG.ARIGGUU.MVTS,DISP=(NEW,CATLG,DELETE),
//            VOL=SER=WRK001,UNIT=3390,SPACE=(TRK,(1,1))
//            DCB=(DSORG=PS,LRECL=50,RECFM=FB,BLKSIZE=500)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//*
