//IMPRIM PROC OUTC=*,MBR=,FIC=NULLFILE
//IMP EXEC PGM=IEBGENER
//SYSUT1 DD DISP=SHR,DSN=&FIC&MBR
//SYSUT2 DD SYSOUT=&OUTC
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY
