//ARI0101A JOB (ACCT#),'ARI0101',MSGCLASS=H,
//         CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//IMPRIM EXEC PGM=IEBGENER
//SYSUT1 DD DISP=SHR,DSN=ARI01.ARI0101.SRC(ARIOT11)
//SYSUT2 DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY
