//ARI0101A JOB (ACCT#),'ARI0101',MSGCLASS=H,
//         CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//      JCLLIB ORDER=(ARI01.ARI0101.JCL)
//IMP01 EXEC IMPRIM
//IMP02 EXEC IMPRIM,FIC=ARISYS.ADREF.XV99R00.STOCK
//IMP03 EXEC IMPRIM,FIC=ARISYS.ADREF.XV99R00.STOCK,OUTC=R
//IMP04 EXEC IMPRIM,FIC=ARI01.ARI0101.SRC,
//      MBR=(ARIOT11)
